Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: С помощью логистической регрессии можно оценивать вероятность того, что событие наступит для конкретного испытуемого (больной/здоровый, возврат кредита/дефолт и т.д.).
en: The logistic regression enables to estimate possibility of the event occurrence for a particular test person (sick/healthy person, credit repayment/default, etc).

source: С помощью обработчика Соединение исходный набор данных дополняется полями присоединяемых наборов.
en: The source data set is appended with the fields of the joined data sets by means of the Column Union handler.

source: С помощью обработчика Объединение исходный набор данных дополняется записями присоединяемых наборов.
en: The source data set is appended with the records of the joined data sets by means of the Union handler.

source: С помощью переключателя Фильтр можно изменить способ отображения полей: общим списком или только поля, которые еще не выбраны.
en: The Filter switch enables to change the method of fields representation: complete list or only the fields that have not been selected yet.

source: С помощью собственного режима активации можно принудительно задать режим выполнения с переобучением или без переобучения.
en: Using the own activation mode, it is possible to set the execution mode forcibly with or without retraining.

source: С помощью специальных обработчиков имеется возможность преобразовать данные из таблиц в переменные и обратно.
en: It is possible to convert the data from tables to variables and vice versa using the special handlers.

source: С помощью этих обработчиков можно оценить и/или визуализировать структуру и статистические характеристики данных.
en: These handlers enable to assess and/or visualize the structure and statistical data characteristics.

source: С примерами и документацией использования модулей CommonJS можно ознакомится в статье JavaScript: Импорт внешних модулей.
en: Examples and documents related to the usage of the CommonJS modules are described in the following article: JavaScript: Import of External Modules.

source: С учетом регистра.
en: Case-sensitive.

source: Самоорганизующаяся нейронная сеть.
en: Self-organizing network.

source: Самоорганизующиеся сети позволяют выявлять кластеры (группы) входных векторов, обладающих некоторыми общими свойствами.
en: Self-organizing networks enable to detect clusters (groups) of input vectors that have some common properties.

source: Сахарница расписная
en: Painted sugar bowl

source: Сб
en: Saturday

source: Сбросить сортировку.
en: Clear sort.

source: Сверху расположена панель инструментов, содержащая следующие операции для манипуляции с областью построения и ее составляющими:
en: The toolbar that enables the following operations with the construction area and its constituents is located in the upper part:

source: Светлая таблица.
en: Light table.

source: Свойства InputVariables
en: InputVariables Properties

source: Свойства OutputTable
en: OutputTable Properties

source: Свойства источника данных
en: Data Source Properties

source: Свойства пакета
en: Package Properties

source: Свойства узла (метки свойств) отображаются в виде дерева.
en: The node properties (captions of properties) are displayed in the form of a tree.

source: Связана с проверкой равенства средних значений в двух выборках
en: It is connected with test for equality of average values in two samples

source: Связи между узлами можно удалять:
en: It is possible to delete the links between nodes as follows:

source: Связи также можно установить вручную, с помощью метода Drag-and-drop путем перетаскивания элемента из левого списка на элемент из правого списка.
en: Links can be also established in the manual way using the Drag-and-drop method by dragging the item from the left list to the item from the right list.

source: Связывание допускается только для полей с одинаковыми типами данных.
en: Linking is allowed only for the fields with the similar data types.

source: Связывание портов
en: Linking of Ports

source: Связывать переменные на этом этапе необязательно.
en: It is not required to link variables at this stage.

source: Связывать следует поля групп, одинаковые для обеих таблиц — для этого достаточно перетащить метку поля из одной таблицы на соответствующую метку поля из другой таблицы, если образованная при этом связь ошибочна, удалить ее можно нажатием на расположенную на ней кнопку Удалить.
en: It is required to link the group fields that are the same for both tables. For this purpose, it is sufficient to drag the field caption from one table to the corresponding field caption from another table if the link established in such a manner is erroneous, it can be deleted by pressing Delete button that is located on it.

source: Связь между полями можно удалить, либо настроить на другое поле.
en: The link between the fields can be deleted or set to another field.

source: Сгененрированное пространство имен, которое будет использоваться для публикации, отображается в окне мастера.
en: The generated namespace that will be used for publication will be displayed in the wizard window.

source: Сделать клик по одному полю, зажать клавишу SHIFT, затем клик по другому полю — в результате будет выделен список позиций между этими полями.
en: Click on one field, press SHIFT button. Then it is required to click on another field. The list of positions between these fields will be selected in the result.

source: Сделать это можно несколькими способами:
en: It can be done in several ways:

source: Сезон
en: Season

source: Сезонность.
en: Seasonality.

source: Секунды - секунды в виде числа.
en: Seconds - seconds in the form of a number.

source: Семантический слой
en: Semantic Layer

source: Семена тюльпанов красных
en: Seeds of red tulips

source: Серая.
en: Grey.

source: Сервер имеет несколько параметров, определяющих режим функционирования.
en: The server has several parameters that define the operation mode.

source: Серверная версия Loginom
en: Server Loginom Version

source: Серверные редакции (Team, Standard, Enterprise)
en: Server Editions (Team, Standard, Enterprise)

source: Серверы.
en: Servers.

source: Серверы: 12c, 11g, 10g, 9i, 8i, 8.0, включая Oracle Express Edition 11g и 10g
en: Servers: 12c, 11g, 10g, 9i, 8i, 8.0, including Oracle Express Edition 11g and 10g

source: Серверы: 5.7, 5.6, 5.5, 5.1, 4.1 и 4.0
en: Servers: 5.7, 5.6, 5.5, 5.1, 4.1 and 4.0

source: Сети Кохонена представляют собой разновидность самоорганизующихся карт признаков, которые, в свою очередь, являются специальным типом нейронных сетей.
en: Kohonen networks represent a kind of self-organising maps that, in their turn, represent a special type of neural networks.

source: Сеть Кохонена состоит из узлов, которые объединяются в кластеры.
en: Kohonen network consists of the nodes that are combined into clusters.

source: Сеть Кохонена.
en: Kohonen network.

source: Сильная (100);
en: Strong (100).

source: Сильная (80).
en: Strong (80).

source: Символ табуляции;
en: Tab character

source: Символов подчеркивания;
en: Underscore characters.

source: Симметричное без крайней точки;
en: Symmetric without extreme point

source: Симметричное;
en: Symmetric

source: Синтаксис и семантика совместимы с регулярными выражениями Perl.
en: Syntax and semantics are compatible with the Perl regular expressions.

source: Синтаксис калькулятора
en: Calculator Syntax

source: Синтаксис строки запуска в пакетном режиме:
en: Syntax of the start string in the batch mode:

source: Синтаксис строки форматирования даты/времени
en: Syntax of the Date/Time Formatting Strings

source: Системные требования
en: System Requirements

source: Скорректированный коэффициент детерминации (AdjustedR2)
en: Adjusted determination coefficient (AdjustedR2)

source: Слабая (0,001).
en: Weak (0.001).

source: Слабая (40).
en: Weak (40).

source: Слева расположен список полей входного набора данных.
en: The list of the input data set fields is located on the left.

source: Слева расположено главное меню с кнопками: Меню, Пакеты, Навигация, Файлы, Процессы.
en: The main menu with the following buttons is located on the left: Menu, Packages, Navigation, Files, Processes.

source: Следовательно, обработка методом скользящего окна имеет два параметра:
en: Thus, the processing based on the windowing method has two parameters:

source: Следовательно, частная автокорреляционная функция более точно характеризует автокорреляционные зависимости внутри временного ряда.
en: Consequently, partial autocorrelation function provides more detailed characteristics of the autocorrelation dependence inside the time lag.

source: Следует отметить, что если узел, который необходимо сделать доступным, находится внутри иерархии Подмоделей, то все эти Подмодели также должны быть доступны (иметь соответствующий модификатор доступа).
en: It should be noted that if the node that must be made available is located inside the Supernodes hierarchy, all these Supernodes must also be available (namely, they must have their own access modifier).

source: Следует применять, если необходимо узнать линейную зависимость между двумя процессами или частями процессов, происходящими с некоторым временным лагом.
en: It should be applied if it is required to determine the linear relationship between two processes, or parts of the processes that occur with a certain time lag.

source: Следует учитывать, что в узле, заключенном в цикл, должна присутствовать операция над этой переменной, которая приводит к выполнению условия выхода из цикла, иначе цикл получится бесконечным.
en: It should be noted that the looped node must presuppose the operation with this variable that will enable to meet the loop exit condition, otherwise, the loop will be infinite.

source: Следует учитывать, что максимальное количество уникальных значений в поле не должно превышать десять тысяч.
en: It is required to take into account that the maximum count of unique values in the field must not exceed ten thousand.

source: Следующая блок-схема (см.
en: The following flowgraph (refer to

source: Следующие настройки применяются для формирования результирующего набора данных вручную:
en: The following settings are used to generate the resulting data set in the manual way:

source: Следующие параметры выражений доступны для изменений:
en: The following expression parameters can be changed:

source: Следующий пример демонстрирует вычисление суммы двух полей Калькулятора:
en: The next example shows how to calculate the sum of two Calculator fields:

source: Следующим шагом в алгоритме необходимо подсчитать общие суммы покупок по всем клиентам.
en: The next algorithm step is calculation of purchase sum for all clients.

source: Слияние наборов данных, связанных по ключевым полям — аналог операции JOIN в SQL.
en: Join of the data sets that are connected by the key fields — analogue of the JOIN operation in SQL.

source: Случайный - данные для тестового и обучающего множеств формируется из всего объема входных данных в случайном порядке и случайной пропорции.
en: Random: the data for the test and training sets is formed from the whole volume of the input data in random order and proportion.

source: Случайный — случайно разбивает множество записей на обучающее и тестовое множество.
en: Random method provides partitioning of records set to training and test sets.

source: Слэш (/);
en: Slash (/)

source: См.
en: Also refer to

source: Сначала из Источника удаляется подстрока, начиная с позиции Начало длиной Длина.
en: At first, substring is deleted from the Source, starting from the Start position of the Length length.

source: Сначала отбираются записи для обучающей выборки, оставшиеся используются для тестовой (этот порядок можно изменить в мастере настройки обработчика).
en: The training sample records are selected first, the remaining ones are used for the test one (this order can be changed in the handler wizard).

source: Снять галочку Автоопределение числа кластеров.
en: Uncheck Auto selection of clusters.

source: Собственный режим активации узла
en: Own node activation mode

source: Событие
en: Event

source: Событие|Прогноз.
en: Event|Prediction.

source: Событие|Факт.
en: Event|Actual.

source: Событий всех классов;
en: Events of all classes;

source: Событий и Не-событий всех классов;
en: Events and non-events of all classes;

source: События
en: Events

source: Совместимость
en: Compatibility

source: Совместимость веб-сервисов Loginom с Deductor
en: Compatibility of the Loginom Web Services with Deductor

source: Совокупность названий начальных классов, которые входят в конечный класс
en: A set of names of the fine classes included into the coarse class

source: Совпадение
en: Match

source: Содержание выходного набора
en: Content of the Output Data Set

source: Содержать данные двух столбцов.
en: It must contain data of two columns.

source: Содержит все строки, которые были взяты для обеих выборок.
en: It contains all strings taken from both samples.

source: Содержит два флажка:
en: It contains two checkboxes:

source: Содержит доступное для чтения количество входных переменных узла.
en: It contains read-only count of the input node variables.

source: Содержит доступное для чтения количество столбцов выходного набора данных.
en: It contains read-only count of columns of the output data set.

source: Содержит доступное для чтения количество столбцов.
en: It contains read-only count of columns.

source: Содержит доступное для чтения количество строк выходного набора данных.
en: It contains read-only count of rows of the output data set.

source: Содержит доступное для чтения количество строк.
en: It contains read-only count of rows.

source: Содержит доступную для чтения коллекцию входных переменных узла.
en: It contains read-only collection of the input variables of the node.

source: Содержит доступную для чтения коллекцию столбцов выходного набора данных.
en: It contains read-only collection of columns of the output data set.

source: Содержит доступную для чтения коллекцию столбцов.
en: It contains read-only collection of columns.

source: Содержит исходную таблицу, к которой добавлены поля факторов.
en: It contains the source table to which factors fields are added.

source: Содержит настройки фильтрации основной таблицы (см.
en: It contains filtration settings of the main table (refer to

source: Содержит параметры подключения к списку (набору) файлов.
en: It contains parameters of connection to the list (set) of files.

source: Содержит следующие управляющие элементы:
en: It contains the following control elements:

source: Содержит сравнительную информацию по кластерам, выделенным в Основной таблице.
en: It contains the comparative information on the clusters selected in the Main table.

source: Содержит таблицу факторных нагрузок.
en: It contains the table of factor loadings.

source: Содержит транзакции входного набора данных, в которых срабатывают выявленные правила.
en: It contains transactions of the input data set in which the detected rules are effectively implemented.

source: Соединение таблиц данных на основе связи по ключевым полям — аналог операции LEFT JOIN в SQL.
en: Join of the data tables based on connection by the key fields — analogue of the LEFT JOIN operation in SQL.

source: Соединяемые наборы могут обрезаться до количества записей меньшего набора или дополняться до наибольшего.
en: The joined data sets can be cut up to the number of records of the smaller data set, or they can be appended up to the largest one.

source: Создав один раз компонент «ABC-анализа», его можно применять как в задаче сегментации товаров, так и в сегментации клиентской базы.
en: Having once created the "ABC analysis" component, it can be applied both for solution of the goods and customer base segmentation task.

source: Создадим простой сценарий, формирующий ТОП10 лучших клиентов.
en: Let's create a simple workflow that will form TOP10 list of the best clients.

source: Создает новые поля, которые вычисляются по заданной формуле из значений переменных, других полей и функций или используя JavaScript код.
en: It enables to create the new fields that are calculated by the defined formula based on the values of variables, other fields and functions, or using the JavaScript code.

source: Создание и настройка производного компонента
en: Creation and Configuration of the Derived Component

source: Создание и публикация веб-сервиса
en: Web Service Creation and Publication

source: Создание подключения
en: Connection Creation

source: Создание собственных веб-сервисов
en: Creation of Own Web Services

source: Созданное подключение в дальнейшем может использоваться в пакете многократно.
en: Later on, the created connection can be repeatedly used in the package.

source: Созданное подключение необходимо поместить в сценарий, для этого необходимо создать узел, выходными данными которого будут являться параметры подключения к источнику данных.
en: It is required to place the created connection into the workflow; for this purpose you are to create the node the output data of which will be parameters of connection with the data source.

source: Созданные дочерние узлы можно расположить в удобном для себя порядке.
en: The created child nodes can be located in any convenient order.

source: Созданные связи между узлами можно удалять.
en: It is possible to delete the created links between nodes.

source: Созданный на базе данного компонента узел позволяет импортировать таблицу или представление из базы данных, либо результаты выполнения заданного пользователем SQL-запроса.
en: The node created on the basis of this component enables to import a table or view from database, or results of execution of the SQL query set by a user.

source: Создать переменные можно следующими способами:
en: It is possible to create variables using one of the following methods:

source: Создать пользователя со способом Аутентификации LDAP.
en: Create user by means of the LDAP Authentification method.

source: Сокращение размерности данных за счет исключения признаков с низкой значимостью, снижения разнообразия значений признаков.
en: Reduction of data dimensionality by excluding the indicators with low significance, by decreasing variety of indicator values.

source: Соответственно, граничные значения входят в тот интервал, где они являются начальными.
en: Thus, the bound values are included into the interval in which they are the initial ones.

source: Соответствует имени файла без расширения, приведенному к правильному идентификатору.
en: It complies with the file name without extension set to the correct identifier.

source: Соответствующие объекты доступны только в том случае, когда они опубликованы для общего доступа.
en: Corresponding objects are available only if they are published for shared access.

source: Сопоставить поля (или переменные) входного набора порта с полями выходного.
en: Map the fields (or variables) of the input port data set with the fields of the output one.

source: Сопоставление возможно только для полей с одинаковым типом данных.
en: Mapping is possible only for the fields with the same data type.

source: Сопоставление переменных
en: Mapping Variables

source: Сопоставление полей
en: Fields Mapping

source: Сопоставление полей для формирования XML
en: Fields Mapping for XML Generation

source: Сопоставление полей для экспорта
en: Fields Mapping for Export

source: Сопоставленные таким образом ключевые поля соединяются линиями связей.
en: The key fields mapped by this method are linked by the connection lines.

source: Сортировка возможна по возрастанию и по убыванию.
en: It is possible to sort in ascending and descending order.

source: Сортировка показателей гистограммы по убыванию/возрастанию;
en: Sorting of the histogram indicators in ascending/descending order.

source: Сортировку можно произвести по нескольким столбцам.
en: Sorting is possible by several columns.

source: Состав и параметры полей выходного набора задаются в мастере настройки узла и не могут быть изменены в ходе выполнения кода.
en: Composition and parameters of the output data set fields are set in the node wizard, and they can be changed during the code execution.

source: Состав окна Добавить общую папку/Настройка общей папки:
en: Composition of Add shared folder/Configure shared folder window:

source: Составная.
en: Composite.

source: Состоит из полей:
en: It consists of the following fields:

source: Сохранить данную настройку пользователь не может.
en: A user cannot save this setting.

source: Сохранить пакет можно будет уже во время работы с ним.
en: It is possible to save the package only during the process of work with it.

source: Сохранять в текущем — сохраняет значения совпадающих наблюдений в текущем (более низком) интервале разделения.
en: Keep in current: keeps the values of matching observations in the current (lower) separation bin.

source: Спагетти
en: Spaghetti

source: Спектр.
en: Spectrum.

source: Списки можно связать автоматически, воспользовавшись кнопкой Связать автоматически.
en: It is possible to auto link the lists using Auto link all button.

source: Список Индикаторов:
en: List of Indicators:

source: Список возможных условий и типы данных, к которым они применимы.
en: A list of possible conditions and data types to which they can be applied.

source: Список входных столбцов
en: List of Input Columns

source: Список входных/выходных полей/переменных не изменяется (новые поля не добавляются).
en: The list of the input/output fields/variables is not changed (the new fields are not added).

source: Список выбора содержит переменные, передаваемые на выходные порты узла, заключенного в цикл.
en: The selection list contains the variables sent to the output ports of the looped node.

source: Список выражений
en: List of Expressions

source: Список драйверов ODBC, для которых предусмотрено использование строки подключения:
en: List of the ODBC drivers for which it is recommended to use the connection string:

source: Список замен
en: List of Replacements

source: Список запрещенных операций
en: List of Prohibited Operations

source: Список значений
en: List of Values

source: Список измерений и фактов
en: List of Dimensions and Measures

source: Список имен входных полей
en: List of input fields names

source: Список источников вызывается при клике мышью по кнопке .
en: List of the sources is called by clicking on button.

source: Список меток (названий) входных полей
en: List of captions (names) of input fields

source: Список можно отсортировать, нажав по колонке Параметр или Тип.
en: It is possible to sort the list by pressing the Parameter or the Type column.

source: Список недоступен для полей-переменных.
en: The list is not available for variable fields.

source: Список позволяет выбрать поле присоединяемой таблицы, которое будет сопоставлено полю главной таблицы.
en: The list enables to select the field of the joined table that will be mapped to the main table field.

source: Список полей можно отфильтровать, введя имя или метку поля в области фильтрации.
en: It is possible to filter the list of fields by specifying the field name or caption in the filter area.

source: Список полей можно отфильтровать, введя метку поля в области фильтрации.
en: It is possible to filter the list of fields by specifying the field caption in the filter area.

source: Список предустановленных в ОС Windows драйверов ODBC:
en: List of the ODBC drivers preinstalled in Windows OS:

source: Список режимов масштабирования:
en: List of the Scaling Modes:

source: Список соответствует полям входного порта.
en: The list complies with the input port fields.

source: Список уникальных значений полей
en: List of unique values of fields

source: Список функций
en: List of Functions

source: Сплайн-интерполяция
en: Spline interpolation
